Repository: Simulador-SimuS/SimuS
Catalog: locale/simus.*.po
Languages: pt

source: ADC (add with carry) instruction adds the contents of the memory position to the contents of the accumulator and the carry.
pt: O comando ADC (add with carry) soma ao acumulador o conteúdo de uma posição de memória indicada pelo operando, acrescido do valor do Carry (vai um).

source: ADD instruction adds the contents of the memory position to the contents of the accumulator. The result is stored in the accumulator.
pt: O comando ADD soma ao acumulador o conteúdo de uma posição de memória indicada pelo operando.

source: AND performs a binary "AND" between the accumulator and the contents of a memory location indicated by the operand.
pt: O comando AND realiza um "e" binário entre o acumulador e o conteúdo de uma posição de memória indicada pelo operando.

source: ; Author:
pt: ; Autor:

source: Strings start and end with quotation marks.
pt: Cadeias começam e terminam por aspas ou plics.

source: Malformed comment or parameter
pt: Comentário ou parâmetro mal formado

source: Compilation Report:
pt: Compilação (assembly) do texto:

source: ; Date:
pt: ; Data:

source: DB (define bytes) pseudo-instruction loads the value defined by the operand into the current memory position.
pt: A pseudo-instrução DB (define bytes) carrega nesta palavra de memória o valor definido pelo operando.

source: Save before exiting?
pt: Deseja salvar antes de sair?

source: A label is a name given to the current memory position. The name must be followed by a colon.
pt: Um rótulo é um nome dado à posição de memória da instrução a seguir. O nome é seguido por dois pontos.

source: DS (define storage) pseudo-instruction reserves in memory the amount of bytes specified by the operand.
pt: A pseudo-instrução DS (define storage) reserva um número de palavras na memória definido pelo operando.

source: END pseudo-instruction indicates that the source program has ended. This operand is used to pre-load the PC with the starting address of the program execution.
pt: A pseudo-instrução END indica que o programa fonte acabou. O operando é usado para pré-carregar o PC com o endereço inicial de execução do programa.

source: EQU (equate) pseudo-instruction assigns an alias to a numeric value. This command is often used to define a specific memory address to a program variable. For example, to position the variable X into F0H address you shall use: X EQU 0F0H
pt: A pseudo-instrução EQU (equate) atribui um nome a um certo valor. Esse comando é frequentemente usado para especificar variáveis que são posicionadas em certo endereço de memória. Por exemplo para posicionar a variável x no endereço hexa f0 use: X EQU 0F0H

source: Error when loading file
pt: Erro ao carregar o arquivo

source: This instruction has no parameters
pt: Esta instrução não possui parâmetros

source: HLT (halt) stops the machine.
pt: O comando HLT (halt) para a máquina.

source: IN (input) loads the value read into an external device indicated by the operand in the accumulator. In this simulator the devices are: keys (address 0) and the status of "data available " of the keys (address 1).
pt: O comando IN (input) carrega no acumulador o valor lido num dispositivo externo indicado pelo operando. Nesse simulador os dispositivos são: chaves (endereço 0) e o status de "dado disponível" das chaves (endereço 1).

source: Insert
pt: Informe

source: Illegal instruction
pt: Instrução inválida

source: JC (jump if carry) transfers program execution to the memory address given in the operand, only if carry flag equals '1".
pt: O comando JC (jump if carry) desvia a execução do programa para o endereço indicado pelo operando ender, apenas quando a última operação aritmética realizada não coube nos 8 bits do destino.

source: JMP (jump) transfers program execution to the memory address given in the operand, (i.e., it places this address into PC register).
pt: O comando JMP (jump) desvia a execução do programa para o endereço indicado pelo operando (ou seja, coloca este endereço no registrador PC).

source: JN (jump if negative) transfers program execution to the memory address given in the operand, only when the last operation performed produced a value with bit 7 connected.
pt: O comando JN (jump if negative) desvia a execução do programa para o endereço indicado pelo operando, apenas quando a última operação realizada produziu um valor com o bit 7 ligado.

source: JNC (jump if not carry) transfers program execution to the memory address given in the operand, only if carry flag equals '0".
pt: O comando JNC (jump if not carry) desvia a execução do programa para o endereço indicado pelo operando ender, apenas quando a última operação aritmética realizada coube nos 8 bits do destino.

source: JNZ (jump if not zero) transfers program execution to the memory address given in the operand, only when the last operation performed produced a nonzero value.
pt: O comando JNZ (jump if not zero) desvia a execução do programa para o endereço indicado pelo operando ender, apenas quando a última operação realizada produziu um valor diferente de zero.

source: JSR (jump to subroutine) executes a subroutine call. To do this, transfer the 16 bits of the PC (Program Counter) to the stack and put in the PC the 16 bits indicated in the operand. The SP is incremented by 2.
pt: O comando JSR (jump to subroutine) executa uma chamada de subrotina. Para isso, transfere os 16 bits do PC (Program Counter) para a pilha e coloca no PC os 16 bits indicados no operando. O SP é decrementado de 2.

source: JZ (jump if zero) transfers program execution to the memory address given in the operand, only when the last executed operation produced a zero value.
pt: O comando JZ (jump if zero) desvia a execução do programa para o endereço indicado pelo operando, apenas quando a última operação realizada produziu um valor zero.

source: LDA (load accumulator) assigns the accumulator the contents of the memory location indicated by the operand.
pt: O comando LDA (load accumulator) atribui ao acumulador o conteúdo da posição de memória indicada pelo operando.

source: LDS (load from stack pointer) transfers the stack pointer to 16 bits in the memory indicated by the operand.
pt: O comando LDS (load from stack pointer) transfere o apontador da pilha (Stack Pointer) para 16 bits na memória indicada pelo operando.

source: List
pt: Listagem

source: NOP (no operation) does nothing.
pt: O comando NOP (no operation) é usado apenas para gastar tempo.

source: NOT complements the accumulator contents. In other words, it flips '1's into '0's and '0's into '1's.
pt: O comando NOT (negate) transforma 1 em 0 e 0 em 1 nos bits do acumulador.

source: New ACC value
pt: Novo valor do ACC

source: New flag C value
pt: Novo valor do flag C

source: New flag N value
pt: Novo valor do flag N

source: New flag Z value
pt: Novo valor do flag Z

source: New PC value
pt: Novo valor do PC

source: Number of errors found:
pt: Número de erros encontrados:

source: Invalid operand
pt: Operando inválido

source: Malformed operand
pt: Operando mal formado

source: OR performs a logical "OR" between the accumulator and the contents of a memory location indicated by the operand.
pt: O comando OR realiza um "ou" lógico entre o acumulador e o conteúdo de uma posição de memória indicada pelo operando.

source: ORG (origin) pseudo-instruction indicates to the assembler the memory location where the next instruction will be placed.
pt: A pseudo-instrução ORG (origin) indica ao assembler a posição de memória onde será colocada a próxima instrução.

source: Invalid source
pt: Origem inválida

source: This parameter type is incompatible with the instruction
pt: O tipo de parâmetro é incompatível com a instrução

source: OUT (output) transfers the accumulator value to an external device indicated by the operand. In this simulator the only available device is a display (address 0).
pt: O comando OUT (output) transfere o valor do acumulador para um dispositivo externo indicado pelo operando. Nesse simulador o único dispositivo disponível é um visor (endereço 0).

source: EQU Parameter with error
pt: Parâmetro do EQU com erro

source: Comments start with a semicolon.
pt: Os comentários são começados por ponto e vírgula.

source: POP (pop from stack) copies the top of the stack (8 bits) to the accumulator. The SP is decremented by 1.
pt: O comando POP (pop from stack), traz para o acumulador o topo da pilha (8 bits). O SP é decrementado de 1.

source: Please, fill in the operand.
pt: Por favor, preencha o operando.

source: Please fill in the label.
pt: Por favor, preencha o rótulo.

source: ; Program:
pt: ; Programa:

source: Pseudo-instruction does not permit immediate neither indirect
pt: Pseudo-instrução não permite imediato nem indireto

source: PUSH (push to stack) copies the contents of the accumulator to the top of the stack. The SP is incremented by 1.
pt: O comando PUSH (push to stack), coloca o conteúdo do acumulador no topo da pilha. O SP é incrementado de 1.

source: RET (return from subroutine) instruction returns from a JSR call. In other words, it transfers 16 bits of the stack to the PC, and updates the SP. The SP is decremented by 2.
pt: O comando RET (return from subroutine), retorna de uma chamada JSR. Para isso, transfere para o PC 16 bits da pilha, e atualiza o SP. O SP é decrementado de 2.

source: - duplicate label
pt: - rótulo duplicado

source: SBC (subtract with carry) subtracts from the accumulator the contents of a memory location indicated by the operand, decreasing it if the carry is on.
pt: O comando SBC (subtract with carry) subtrai do acumulador o conteúdo de uma posição de memória indicada pelo operando, decrementando-o se o carry ligado.

source: SHA (shift right arithmetic) instruction shifts the accumulator bits to the right (the same as divide by 2). Bit 7 is kept the same. Bit 0 (which would be lost) is stored in the Carry.
pt: O comando SHA (shift right aritmético) desloca os bits do acumulador para a direita (ou seja, divide por 2). O bit 7 é mantido igual. O bit 0 (que seria perdido) é armazenado no Carry.

source: SHL (shift left) instruction shifts the accumulator bits to the left (the same as multiplying by 2). Bit 0 is set to 0. Bit 7 (which would be lost) is stored in the Carry.
pt: O comando SHL (shift left) desloca os bits do acumulador para a esquerda (ou seja, multiplica por 2). O bit 0 recebe o valor 0. O bit 7 (que seria perdido) é armazenado no Carry.

source: SHR (shift right) instruction shifts the accumulator bits to the right (the same as dividing by 2). Bit 7 is set to 0. Bit 0 (which would be lost) is stored in the Carry.
pt: O comando SHR (shift right) desloca os bits do acumulador para a direita (ou seja, divide por 2). O bit 7 recebe o valor 0. O bit 0 (que seria perdido) é armazenado no Carry.

source: Symbol Line Address
pt: Símbolo Linha Endereço

source: Sapiens-8 processor simulator
pt: Simulador do processador Sapiens-8

source: STA (store accumulator) transfers the value of the accumulator to the memory location indicated by the operand.
pt: O comando STA (store accumulator) transfere o valor do acumulador para a posição de memória indicada pelo operando.

source: STS (store into stack pointer) transfers 16 bits of the memory indicated by the operand to the stack pointer (Stack Pointer).
pt: O comando STS (store into stack pointer) transfere 16 bits da memória indicada pelo operando para o apontador da pilha (Stack Pointer).

source: SUB (subtract) instruction subtracts from the accumulator the contents of a memory location indicated by the operand.
pt: O comando SUB (subtract) subtrai do acumulador o conteúdo de uma posição de memória indicada pelo operando.

source: TRAP simulates an operating system function, to simplify input and output programming.
pt: O comando TRAP simula a execução uma função de sistema operacional, para simplificar a programação de entrada e saída.

source: Are you sure?
pt: Tudo foi salvo?

source: Typed value inconsistent with specified base
pt: Valor digitado inconsistente com a base especificada

source: XOR (exclusive OR) performs a logical "xor" between the accumulator and the contents of a memory location indicated by the operand.
pt: O comando XOR (exclusive OR) realiza um "xor" lógico entre o acumulador e o conteúdo de uma posição de memória indicada pelo operando.

source: of symbol table
pt: da tabela de símbolos

source: In
pt: Em

source: - Sapiens-8 processor simulator
pt: - Simulador do processador Sapiens-8

source: ********* Warning:
pt: ********* Atenção:

source: ********* Error:
pt: ********* Erro:

source: About SimuS
pt: Sobre o programa

source: Simus - Didactic Simulator for computer architecture teaching.
pt: SimuS - Simulador didático para ensino de arquitetura de computadores.

source: Version 1.1 - February/2018
pt: Versão 1.1 - Fevereiro/2018

source: Comment
pt: Comentários

source: Insert into source program
pt: Incluir no programa fonte

# tformautomonta.b_rotulo.caption
source: Label
pt: Rótulo

# tformautomonta.caption
source: Guided Programming
pt: Criação tutorada de programas

source: Immediate
pt: Imediato

source: Indirect
pt: Indireto

source: Description
pt: Descrição

source: Operand
pt: Operando

# tformautomonta.l_rotulo.caption
source: Label
pt: Rótulo

source: Hide
pt: Esconder

source: Clean
pt: Limpar

source: Convert
pt: Converter

# tformhex.caption
source: Base Converter
pt: Conversão entre bases

# tformhex.de_binario.caption
source: Binary
pt: Binário

source: From
pt: De

source: To
pt: Para

# tformhex.para_binario.caption
source: Binary
pt: Binário

# tformprincipal.abrir1.caption
source: Open
pt: Abrir

source: Open Example
pt: Abrir exemplo

source: Load Hex
pt: Carregar Hexa

source: File
pt: Arquivo

source: Programming Guide
pt: Tutor de programação

source: BreakPoint Select a line on debugging, then click here.
pt: BreakPoint Selecione uma linha na aba depuração, em seguida clique aqui.

source: Enter
pt: Entrar

source: Run
pt: Executar

source: Halt
pt: Parar

source: Step-by-Step
pt: Passo a passo

# tformprincipal.b_zera.caption
source: Reset
pt: Limpar

source: SimuS - Sapiens-8 Processor Simulator
pt: SimuS - Simulador do processador Sapiens-8

source: Hex
pt: Hexa

source: Fast
pt: Rápido

# tformprincipal.colar1.caption
source: Paste
pt: Colar

source: Compilation
pt: Compilação

# tformprincipal.compilar1.caption
source: Compile
pt: Compilar

# tformprincipal.compilebtn.hint
source: Compile
pt: Compilar

# tformprincipal.conversordebases1.caption
source: Base Converter
pt: Conversor de bases

source: Copy
pt: Copiar

source: Copy selection
pt: Copiar seleção

source: Cut selection
pt: Cortar seleção

source: Undo
pt: Desfazer

source: Display
pt: Visor

source: Editing
pt: Edição

source: Edit
pt: Editar

source: Debugging
pt: Depuração

source: Address
pt: Endereço

source: Running:
pt: Executando:

source: Instruction:
pt: Instrução:

source: New value
pt: Novo valor

source: Registers
pt: Registradores

source: Value:
pt: Valor:

# tformprincipal.newbnt.hint
source: New
pt: Novo

# tformprincipal.novo1.caption
source: New
pt: Novo

# tformprincipal.openbtn.hint
source: Open
pt: Abrir

# tformprincipal.pastebtn.hint
source: Paste
pt: Colar

# tformprincipal.programaotutorada1.caption
source: Guided Programming
pt: Programação Tutorada

source: Ready
pt: Pronto

source: Cut
pt: Recortar

source: Exit
pt: Sair

# tformprincipal.salvar1.caption
source: Save
pt: Salvar

source: Save As
pt: Salvar Como

source: Dump Hex
pt: Descarregar Hexa

# tformprincipal.savebtn.hint
source: Save
pt: Salvar

source: Guide
pt: Tutor

source: Clear Memory
pt: Zerar memória
